In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("Credit_Card_Usage_Data.csv")

In [5]:
df

,Person_ID,Age Group,Usage Frequency,Card Type,Annual Spending (USD),Default History
0,1,36-50,High Usage,MasterCard,9109,No Default
1,2,51+,Low Usage,Visa,6990,No Default
2,3,18-25,Low Usage,Discover,4100,No Default
3,4,36-50,High Usage,Discover,7283,No Default
4,5,36-50,Low Usage,Discover,9646,No Default
...,...,...,...,...,...,...
495,496,36-50,Low Usage,MasterCard,2263,No Default
496,497,36-50,Low Usage,MasterCard,9212,Default
497,498,51+,Low Usage,Amex,6297,No Default
498,499,18-25,Medium Usage,MasterCard,9708,Default
499,500,51+,Low Usage,Amex,7599,No Default

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Person_ID              500 non-null    int64
 1   Age Group              500 non-null    object
 2   Usage Frequency        500 non-null    object
 3   Card Type              500 non-null    object
 4   Annual Spending (USD)  500 non-null    int64
 5   Default History        500 non-null    object
dtypes: int64(2), object(4)
memory usage: 23.6+ KB

In [13]:
df["Age Group"]

0      36-50
1        51+
2      18-25
3      36-50
4      36-50
       ...
495    36-50
496    36-50
497      51+
498    18-25
499      51+
Name: Age Group, Length: 500, dtype: object

In [15]:
df["Usage Frequency"]

0        High Usage
1         Low Usage
2         Low Usage
3        High Usage
4         Low Usage
           ...
495       Low Usage
496       Low Usage
497       Low Usage
498    Medium Usage
499       Low Usage
Name: Usage Frequency, Length: 500, dtype: object

In [19]:
pd.crosstab(df["Age Group"],df["Usage Frequency"],margins=True)

Usage Frequency  High Usage  Low Usage  Medium Usage  All
Age Group
18-25                    35         46            41  122
26-35                    32         34            42  108
36-50                    37         46            39  122
51+                      44         60            44  148
All                     148        186           166  500

In [23]:
#pip install researchpy

In [25]:
import researchpy as rp

In [27]:
table,results=rp.crosstab(df["Age Group"],df["Usage Frequency"],test='chi-square')

C:\Users\dell\anaconda3\Lib\site-packages\researchpy\crosstab.py:146: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Pearson Chi-square ( 6.0) = ' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  table.iloc[0,0] = f"Pearson Chi-square ({dof: .1f}) = "

In [29]:
table

                Usage Frequency
Usage Frequency      High Usage Low Usage Medium Usage  All
Age Group
18-25                        35        46           41  122
26-35                        32        34           42  108
36-50                        37        46           39  122
51+                          44        60           44  148
All                         148       186          166  500

In [31]:
results

                Chi-square test  results
0  Pearson Chi-square ( 6.0) =    3.1186
1                    p-value =    0.7938
2                 Cramer's V =    0.0558

In [35]:
p_value=0.7938
alpha=0.05

In [37]:
if(p_value<alpha):
    print("Ho is rejected and H1 is accepted")
else:
    print("H1 is rejected and H0 is accepted")

H1 is rejected and H0 is accepted